#include <iostream>
using namespace std;

int main() {
    int n;
    double x;

    cout << R"(1 — гривня → долар,
2 — гривня → євро,
3 — долар → гривня,
4 — євро → гривня.)";
    cout << "\nВведiть номер операцii: ";
    cin >> n;
    cout << "Введiть кiлькiсть ваших грошей, обраних у операцii: ";
    cin >> x;

    switch (n)
    {
    case 1:
        cout << "1 гривня = 0.024 долара";
        cout << "\nВашi " << x << " гривень були переведенi в " << x*0.024 << " доларiв";
        break;
    case 2:
        cout << "1 гривня = 0.021 эвро";
        cout << "\nВашi " << x << " гривень були переведенi в " << x*0.021 << " эвро";
        break;
    case 3:
        cout << "1 долар = 42 гривнi";
        cout << "\nВашi " << x << " гривень були переведенi в " << x*42 << " гривень";
        break;
    case 4:
        cout << "1 эвро = 48.74 гривнI";
        cout << "\nВашi " << x << " гривень були переведенi в " << x*48.74 << " гривень";
        break;
    default: 
        cout << "Error!";
    }

    return 0;
}